---
kind: enumMember
id: F:Autodesk.Revit.DB.DeleteWorksetOption.MoveElementsToWorkset
enum: Autodesk.Revit.DB.DeleteWorksetOption
source: html/f49f5cf3-7707-f004-acec-e816ad74a08b.htm
---
# Autodesk.Revit.DB.DeleteWorksetOption.MoveElementsToWorkset

Delete a workset, while moving the elements from the deleted workset to another workset.